[
    {
        "course": "Sociology_Intro",
        "unit": "理解社会学",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会学想象力 (Sociological Imagination)",
                "en": "Sociological Imagination"
            },
            "definition": {
                "zh": "一种认识个体与更广泛社会之间关系的能力，既包括现在也包括过去。它允许我们超越对事物和人的有限理解，获得更广阔的社会视野。",
                "en": "An awareness of the relationship between an individual and the wider society, both today and in the past. It allows us to look beyond a limited understanding of things and people in the world and allows for a broader vision of society."
            },
            "hint": {
                "zh": "将个人问题置于社会背景中理解。",
                "en": "Understanding personal troubles within a broader social context."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "科学方法",
                "en": "Scientific Method"
            },
            "definition": {
                "zh": "科学方法是一系列系统化、有组织的步骤，确保在研究问题时达到最大程度的客观性和一致性。\n\n简单来说：这是一套严谨的研究流程，就像做实验的步骤一样，确保研究结果尽可能准确、可靠，并且可以被其他人验证。",
                "en": "The scientific method is a systematic, organized series of steps that ensures maximum objectivity and consistency in researching a problem.\n\nIn simple terms: It's a rigorous research process, like the steps in an experiment, designed to ensure that research results are as accurate and reliable as possible, and can be verified by others."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "操作性定义",
                "en": "Operational Definition"
            },
            "definition": {
                "zh": "操作性定义是对抽象概念的解释，其具体程度足以让研究人员评估或衡量该概念。\n\n简单来说：就是把一个抽象的词（比如“幸福”或“社会地位”）变成可以具体测量和观察的东西。例如，要研究“社会地位”，可以将其操作性定义为“是否是某高级俱乐部的会员”。",
                "en": "An operational definition is an explanation of an abstract concept that is specific enough to allow a researcher to assess or measure the concept.\n\nIn simple terms: It's turning an abstract term (like 'happiness' or 'social status') into something that can be concretely measured and observed. For example, to study 'social status,' one might operationally define it as 'membership in exclusive social clubs'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "假设",
                "en": "Hypothesis"
            },
            "definition": {
                "zh": "假设是关于两个或多个变量之间关系的推测性陈述。\n\n简单来说：就是对研究问题的一个初步的、可验证的猜测或预测，通常说明了不同事物之间可能存在的关系。比如，“学习时间越长，考试成绩越高”。",
                "en": "A hypothesis is a speculative statement about the relationship between two or more variables.\n\nIn simple terms: It's an initial, testable guess or prediction about a research question, usually stating a possible relationship between different things. For example, 'The longer the study time, the higher the exam score'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "变量",
                "en": "Variable"
            },
            "definition": {
                "zh": "变量是可测量的特质或特征，在特定条件下会发生变化。\n\n简单来说：研究中可以改变或测量的任何事物，比如年龄、收入、受教育程度等。",
                "en": "A variable is a measurable trait or characteristic that is subject to change under certain conditions.\n\nIn simple terms: Anything that can change or be measured in a study, such as age, income, or education level."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "自变量",
                "en": "Independent Variable"
            },
            "definition": {
                "zh": "自变量是因果关系中导致或影响另一个变量变化的变量。\n\n简单来说：研究中被研究者操纵或改变的因素，它被认为是“原因”。比如在“学习时间影响考试成绩”中，“学习时间”就是自变量。",
                "en": "The independent variable is the one in a causal relationship that causes or influences a change in another variable.\n\nIn simple terms: It's the factor manipulated or changed by the researcher in a study, considered to be the 'cause.' For example, in 'study time affects exam scores,' 'study time' is the independent variable."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "因变量",
                "en": "Dependent Variable"
            },
            "definition": {
                "zh": "因变量是被自变量改变或依赖于自变量的变量。\n\n简单来说：研究中被观察和测量的结果，它被认为是“结果”。比如在“学习时间影响考试成绩”中，“考试成绩”就是因变量。",
                "en": "The dependent variable is the variable in a causal relationship that is subject to the influence of another variable.\n\nIn simple terms: It's the outcome observed and measured in a study, considered to be the 'effect.' For example, in 'study time affects exam scores,' 'exam scores' is the dependent variable."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "控制变量",
                "en": "Control Variable"
            },
            "definition": {
                "zh": "控制变量是为检验自变量和因变量之间关系的强度而保持不变的因素。\n\n简单来说：在研究中，为了确保结果的准确性，需要保持不变的因素，以排除它们对结果的影响。比如研究学习时间对成绩的影响时，要控制学生的智力水平或学习环境。",
                "en": "A control variable is a factor that is held constant to test the relative impact of an independent variable.\n\nIn simple terms: In research, these are factors that need to be kept constant to ensure accuracy and exclude their influence on the results. For example, when studying the effect of study time on grades, one might control for students' intelligence levels or learning environment."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "因果逻辑",
                "en": "Causal Logic"
            },
            "definition": {
                "zh": "因果逻辑是指条件或变量与特定结果之间的关系，其中一个导致另一个。\n\n简单来说：就是A导致B发生，A是原因，B是结果。比如，下雨导致地面湿滑。",
                "en": "Causal logic involves the relationship between a condition or variable and a particular consequence, with one leading to the other.\n\nIn simple terms: It means A causes B to happen, where A is the cause and B is the effect. For example, rain causes the ground to be wet."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "相关性",
                "en": "Correlation"
            },
            "definition": {
                "zh": "当一个变量的变化与另一个变量的变化同时发生时，就存在相关性；然而，相关关系不一定表明因果关系。\n\n简单来说：两个事物一起变化，但一个不一定是另一个的原因。比如，冰淇淋销量增加和溺水事件增加可能同时发生，但冰淇淋不导致溺水，而是夏季气温高导致两者都增加。",
                "en": "A correlation exists when a change in one variable coincides with a change in the other; however, a correlational relationship does not necessarily indicate a causal relationship.\n\nIn simple terms: Two things change together, but one doesn't necessarily cause the other. For example, increased ice cream sales and increased drowning incidents might occur simultaneously, but ice cream doesn't cause drowning; rather, high summer temperatures cause both to increase."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "样本",
                "en": "Sample"
            },
            "definition": {
                "zh": "样本是从更大的人口中进行的选择，该选择在统计学上代表了该人口。\n\n简单来说：从一个大的研究对象群体中挑选出来的一小部分，这小部分要能代表整个大群体，这样研究结果才能推广到大群体。",
                "en": "A sample is a selection from a larger population that is statistically representative of that population.\n\nIn simple terms: A small portion selected from a larger group of study subjects, where this small portion is representative of the entire larger group, so that research findings can be generalized to the larger group."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "随机样本",
                "en": "Random Sample"
            },
            "definition": {
                "zh": "随机样本是指所研究的总体中的每个成员都有相同的机会被选中进行研究的样本。\n\n简单来说：在选择样本时，每个人被选中的机会都是均等的，就像抽签一样，这样可以最大程度地保证样本的代表性。",
                "en": "A random sample occurs when every member of an entire population has the same chance of being selected for the study.\n\nIn simple terms: When selecting a sample, every individual has an equal chance of being chosen, like drawing lots, which maximizes the representativeness of the sample."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "效度",
                "en": "Validity"
            },
            "definition": {
                "zh": "效度是指衡量或量表真实反映所研究现象的程度。\n\n简单来说：你的测量工具是否真的测量了你想测量的东西。比如，一个智力测试是否真的测量了智力，而不是记忆力。",
                "en": "Validity refers to the degree to which a measure or scale truly reflects the phenomenon under study.\n\nIn simple terms: Whether your measurement tool truly measures what you intend to measure. For example, whether an intelligence test truly measures intelligence, not just memory."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "信度",
                "en": "Reliability"
            },
            "definition": {
                "zh": "信度是指衡量产生一致结果的程度。\n\n简单来说：你的测量工具是否能每次都得出相似的结果，即使重复测量。比如，一个体重秤每次称重都显示相同的体重（如果体重没变），它就是可靠的。",
                "en": "Reliability refers to the extent to which a measure produces consistent results.\n\nIn simple terms: Whether your measurement tool consistently yields similar results, even with repeated measurements. For example, if a scale shows the same weight each time (assuming weight hasn't changed), it is reliable."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "研究设计",
                "en": "Research Design"
            },
            "definition": {
                "zh": "研究设计是科学获取或收集数据的详细计划或方法。\n\n简单来说：就是你为了回答研究问题，如何一步步去收集和分析数据的“路线图”或“蓝图”。",
                "en": "A research design is a detailed plan or method for obtaining or collecting data scientifically.\n\nIn simple terms: It's your 'roadmap' or 'blueprint' for how you will systematically collect and analyze data to answer your research question."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "调查",
                "en": "Survey"
            },
            "definition": {
                "zh": "调查通常以访谈或问卷的形式进行，为研究人员提供关于人们如何思考或行为的信息。\n\n简单来说：通过提问（面对面、电话、在线或书面问卷）来收集大量人的观点和信息。",
                "en": "A survey is a study, generally in the form of an interview or questionnaire, that provides researchers with information about how people think and act.\n\nIn simple terms: Collecting information and opinions from a large number of people through questioning (face-to-face, phone, online, or written questionnaires)."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "定量研究",
                "en": "Quantitative Research"
            },
            "definition": {
                "zh": "定量研究是一种主要以数字形式收集和报告数据的方法。\n\n简单来说：用数字和统计来分析数据，比如统计有多少人同意某个观点，或者计算平均收入。",
                "en": "Quantitative research is a method in which data are represented as numbers or statistics.\n\nIn simple terms: Analyzing data using numbers and statistics, such as counting how many people agree with a certain opinion, or calculating average income."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "定性研究",
                "en": "Qualitative Research"
            },
            "definition": {
                "zh": "定性研究依赖于在现场或自然环境中观察到的内容，而不是统计数据。\n\n简单来说：通过深入观察、访谈等方式，收集非数字的、更详细、更深入的信息，以理解人们的感受、经验和意义，而不是简单地统计数量。",
                "en": "Qualitative research relies on what is seen in field or naturalistic settings more than on statistical data.\n\nIn simple terms: Collecting non-numerical, more detailed, and in-depth information through methods like in-depth observation and interviews, to understand people's feelings, experiences, and meanings, rather than simply counting numbers."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "民族志",
                "en": "Ethnography"
            },
            "definition": {
                "zh": "民族志是通过扩展的系统观察来研究整个社会环境。\n\n简单来说：研究者沉浸在一个群体或社区中，通过长时间的直接参与和观察，深入了解他们的生活方式、文化和互动。",
                "en": "Ethnography is the study of an entire social setting through extended systematic observation.\n\nIn simple terms: Researchers immerse themselves in a group or community, gaining an in-depth understanding of their way of life, culture, and interactions through prolonged direct participation and observation."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "观察",
                "en": "Observation"
            },
            "definition": {
                "zh": "观察是一种研究技术，研究者通过直接参与，密切观察一个群体或社区来收集信息。\n\n简单来说：研究者通过亲身参与或近距离观看，来收集关于某个群体或社区的信息。这是民族志的基本技术。",
                "en": "Observation is a research technique in which an investigator collects information through direct participation, by closely watching a group or community.\n\nIn simple terms: A researcher collects information about a group or community by directly participating in or closely watching them. This is a basic technique of ethnography."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "实验",
                "en": "Experiment"
            },
            "definition": {
                "zh": "实验是人为创造的情境，允许研究人员操纵变量。\n\n简单来说：在受控的环境中，研究者改变一个因素（自变量），然后观察这会如何影响另一个因素（因变量），以确定因果关系。",
                "en": "An experiment is an artificially created situation that allows a researcher to manipulate variables.\n\nIn simple terms: In a controlled environment, researchers change one factor (independent variable) and then observe how it affects another factor (dependent variable) to determine cause-and-effect relationships."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "实验组",
                "en": "Experimental Group"
            },
            "definition": {
                "zh": "实验组是实验中暴露于研究人员引入的自变量的受试者。\n\n简单来说：在实验中，接受“处理”或“干预”的那个组。比如，接受新药治疗的病人组。",
                "en": "The experimental group consists of the subjects in an experiment who are exposed to an independent variable introduced by a researcher.\n\nIn simple terms: In an experiment, this is the group that receives the 'treatment' or 'intervention.' For example, the group of patients receiving a new drug."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "控制组",
                "en": "Control Group"
            },
            "definition": {
                "zh": "控制组是实验中未引入自变量的受试者。\n\n简单来说：在实验中，不接受“处理”或“干预”的那个组，用于与实验组进行比较，以确定干预的效果。比如，接受安慰剂的病人组。",
                "en": "The control group consists of the subjects in an experiment who are not introduced to the independent variable by the researcher.\n\nIn simple terms: In an experiment, this is the group that does not receive the 'treatment' or 'intervention,' used for comparison with the experimental group to determine the effect of the intervention. For example, the group of patients receiving a placebo."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "霍桑效应",
                "en": "Hawthorne Effect"
            },
            "definition": {
                "zh": "霍桑效应是指观察者或实验对受试者可能产生的意外影响，导致受试者偏离典型行为。\n\n简单来说：当人们知道自己正在被观察或参与实验时，他们可能会不自觉地改变自己的行为，而不是表现出平时自然的行为。",
                "en": "The Hawthorne effect refers to the unintended influence that observers or experiments can have on their subjects.\n\nIn simple terms: When people know they are being observed or participating in an experiment, they might unconsciously alter their behavior, rather than acting naturally."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "二手分析",
                "en": "Secondary Analysis"
            },
            "definition": {
                "zh": "二手分析是指利用先前收集的或公开可获取的信息和数据的各种研究技术。\n\n简单来说：不是自己去收集新数据，而是使用别人已经收集好的数据（比如政府的普查数据、历史文献）来进行研究。",
                "en": "Secondary analysis refers to a variety of research techniques that make use of previously collected and publicly accessible information and data.\n\nIn simple terms: Instead of collecting new data yourself, you use data that has already been collected by others (e.g., government census data, historical documents) for your research."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "内容分析",
                "en": "Content Analysis"
            },
            "definition": {
                "zh": "内容分析是系统编码和客观记录数据的方法，这些数据由某种原理指导。\n\n简单来说：对报纸、书籍、电影、歌曲等各种文本或媒体内容进行系统性的分析，从中提取信息并找出模式或趋势。",
                "en": "Content analysis involves the systematic coding and objective recording of data, guided by some rationale.\n\nIn simple terms: Systematically analyzing various texts or media content such as newspapers, books, films, and songs, to extract information and identify patterns or trends."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "众数 (Mode)",
                "en": "Mode"
            },
            "definition": {
                "zh": "众数是一系列分数中最常见的单个值。\n\n简单来说：在一组数据中出现次数最多的那个数字。",
                "en": "Mode is the single most common value in a series of scores.\n\nIn simple terms: The number that appears most frequently in a set of data."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "交叉列表",
                "en": "Cross-tabulation"
            },
            "definition": {
                "zh": "交叉列表是显示两个或多个变量之间关系的表格或矩阵。\n\n简单来说：一种表格，用来同时展示两个或多个不同类别的数据，看看它们之间有什么关系，比如性别和对某个政策的看法。",
                "en": "Cross-tabulation is a table or matrix that shows the relationship between two or more variables.\n\nIn simple terms: A table used to display two or more categories of data simultaneously, to see how they relate to each other, such as gender and opinions on a certain policy."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "伦理规范",
                "en": "Code of Ethics"
            },
            "definition": {
                "zh": "伦理规范是为专业成员制定和遵守的可接受行为标准。\n\n简单来说：在进行研究时，研究人员必须遵守的一套行为准则，确保研究过程公正、负责，并保护参与者的权益。",
                "en": "A code of ethics consists of the standards of acceptable behavior developed by and for members of a profession.\n\nIn simple terms: A set of behavioral guidelines that researchers must follow to ensure that the research process is fair, responsible, and protects the rights of participants."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "保密性",
                "en": "Confidentiality"
            },
            "definition": {
                "zh": "保密性是指研究人员保护研究参与者身份和提供信息不被泄露的原则。\n\n简单来说：研究中收集到的个人信息和数据不会被公开，只有研究人员知道，以保护参与者的隐私。",
                "en": "Confidentiality refers to the principle that researchers protect the identity of research participants and the information they provide from being disclosed.\n\nIn simple terms: Personal information and data collected in research will not be made public, known only to researchers, to protect participants' privacy."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "利益冲突",
                "en": "Conflict of Interest"
            },
            "definition": {
                "zh": "利益冲突是指当研究人员的个人利益或资助来源可能影响研究的客观性时出现的情况。\n\n简单来说：当研究人员的个人关系、财务或其他利益，可能影响他们研究的公正性或结果时，就存在利益冲突。",
                "en": "Conflict of interest refers to a situation that arises when a researcher's personal interests or funding sources might influence the objectivity of the research.\n\nIn simple terms: A situation where a researcher's personal relationships, financial gains, or other interests could affect the impartiality or outcome of their research."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "价值中立",
                "en": "Value Neutrality"
            },
            "definition": {
                "zh": "价值中立是马克斯·韦伯提出的术语，指社会学家在解释数据时保持客观性。\n\n简单来说：研究人员在进行研究和解释数据时，不带入自己的个人情感、偏见或价值观，力求客观公正。",
                "en": "Value neutrality is Max Weber's term for objectivity of sociologists in the interpretation of data.\n\nIn simple terms: Researchers conduct their studies and interpret data without letting their personal feelings, biases, or values influence the process, striving for objectivity and impartiality."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "视觉社会学",
                "en": "Visual Sociology"
            },
            "definition": {
                "zh": "视觉社会学涉及使用照片、电影和视频来研究社会。\n\n简单来说：就是用图像和影像（比如照片、电影、视频）作为研究工具，来观察和分析社会现象和人类行为。",
                "en": "Visual sociology involves the use of photographs, film, and video to study society.\n\nIn simple terms: It's using images and moving pictures (like photos, films, and videos) as research tools to observe and analyze social phenomena and human behavior."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会学研究",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "应用社会学",
                "en": "Applied Sociology"
            },
            "definition": {
                "zh": "应用社会学是指运用社会学学科，旨在为人类行为和组织提供实际应用。\n\n简单来说：把社会学的理论和研究成果，用来解决现实世界中的实际问题，比如改善社区关系、提高组织效率等。",
                "en": "Applied sociology involves the use of the discipline of sociology to yield practical applications for human behavior and organizations.\n\nIn simple terms: Applying sociological theories and research findings to solve real-world problems, such as improving community relations or increasing organizational efficiency."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化",
                "en": "Culture"
            },
            "definition": {
                "zh": "文化是习得的、通过社会传播的习俗、知识、物质对象和行为的总和。\n\n简单来说：文化就像是一个社会的“操作手册”和“工具箱”，包含了人们共同学习、分享和传承的所有东西，无论是看得见的物品（如手机、汽车），还是看不见的观念（如价值观、信仰）。",
                "en": "Culture is the totality of learned, socially transmitted customs, knowledge, material objects, and behavior.\n\nIn simple terms: Culture is like a society's 'operating manual' and 'toolbox,' encompassing everything people collectively learn, share, and pass down, whether it's tangible items (like phones, cars) or intangible ideas (like values, beliefs)."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会",
                "en": "Society"
            },
            "definition": {
                "zh": "一个社会是指生活在同一地域、相对独立于其区域外的人口，并参与共同文化的相当数量的人群。\n\n简单来说：一群生活在一起，共享很多东西（比如语言、习俗），并且相互联系的人，就可以称之为社会。例如，一个国家就是一个社会，一个大的部落也可以是一个社会。",
                "en": "A society is a fairly large number of people living in the same territory, who are relatively independent of people outside their area and who participate in a common culture.\n\nIn simple terms: A group of people living together, sharing many things (like language, customs), and interacting with each other can be called a society. For example, a nation is a society, and a large tribe can also be a society."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化普遍性",
                "en": "Cultural Universal"
            },
            "definition": {
                "zh": "文化普遍性是指在世界各地所有文化中都能找到的实践或信仰。\n\n简单来说：就是所有人类社会都会有的一些共同特征，比如家庭、婚礼、体育运动、烹饪等，尽管它们在不同地方的具体形式可能千差万别。",
                "en": "Cultural universals are practices and beliefs found in all cultures around the world.\n\nIn simple terms: These are common characteristics found in all human societies, such as family, weddings, sports, and cooking, even though their specific forms may vary greatly from place to place."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "民族中心主义",
                "en": "Ethnocentrism"
            },
            "definition": {
                "zh": "民族中心主义是指倾向于认为自己的文化和生活方式是规范的或优于所有其他文化的倾向。\n\n简单来说：就是觉得“我们”的方式是最好的，而“他们”的方式是奇怪的或错误的。比如，认为自己的饮食习惯比其他国家的更健康、更美味。",
                "en": "Ethnocentrism refers to the tendency to assume that one's own culture and way of life represent the norm or are superior to all others.\n\nIn simple terms: It's thinking that 'our' way is the best, and 'their' way is strange or wrong. For example, believing your own eating habits are healthier or more delicious than those of other countries."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化相对主义",
                "en": "Cultural Relativism"
            },
            "definition": {
                "zh": "文化相对主义是指从人们自身文化的角度看待其行为和信仰。\n\n简单来说：就是尝试理解别人的文化时，不带有自己的偏见，而是站在他们的角度去理解，认识到不同社会背景会产生不同的规范和价值观。",
                "en": "Cultural relativism refers to the viewing of people's behavior and beliefs from the perspective of their own culture.\n\nIn simple terms: It's trying to understand other cultures without your own biases, putting yourself in their shoes to understand, and recognizing that different social contexts give rise to different norms and values."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会生物学",
                "en": "Sociobiology"
            },
            "definition": {
                "zh": "社会生物学是一门涉及社会行为生物学基础的系统研究的学科。\n\n简单来说：这门学科试图用生物学（比如基因、进化）的原理来解释为什么人类会有某些社会行为，而不是仅仅归结为后天学习或环境影响。",
                "en": "Sociobiology is a discipline that involves the systematic study of the biological bases of social behavior.\n\nIn simple terms: This field attempts to explain why humans exhibit certain social behaviors using biological principles (such as genes, evolution), rather than attributing them solely to learned behavior or environmental influences."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "语言",
                "en": "Language"
            },
            "definition": {
                "zh": "语言是文化所有方面的词义和符号的抽象系统；包括手势和其他非语言交流。\n\n简单来说：语言不只是我们说话、写字用的词语，也包括所有能让我们交流和理解世界的符号系统，比如非语言的手势、表情，甚至数学符号。",
                "en": "Language is an abstract system of word meanings and symbols for all aspects of culture; includes gestures and other nonverbal communication.\n\nIn simple terms: Language is not just the words we speak or write, but also all symbolic systems that allow us to communicate and understand the world, such as nonverbal gestures, expressions, and even mathematical symbols."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "非语言交流",
                "en": "Nonverbal Communication"
            },
            "definition": {
                "zh": "非语言交流包括手势、面部表情和其他习得的视觉图像。\n\n简单来说：就是不通过语言，而是通过身体动作、表情、眼神等方式来传递信息。比如，你高兴时会笑，生气时会皱眉。",
                "en": "Nonverbal communication includes gestures, facial expressions, and other learned visual images.\n\nIn simple terms: It's communicating without words, but through body movements, facial expressions, eye contact, etc. For example, you smile when you're happy and frown when you're angry."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "符号",
                "en": "Symbol"
            },
            "definition": {
                "zh": "符号是构成人类交流基础的手势、对象或词语。\n\n简单来说：任何能代表其他事物的手势、物品或词语都叫符号。比如红绿灯的颜色，或是“和平”手势。",
                "en": "A symbol is a gesture, object, or word that forms the basis of human communication.\n\nIn simple terms: Any gesture, object, or word that represents something else is a symbol. For example, the colors of a traffic light, or the 'peace' sign."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "规范",
                "en": "Norm"
            },
            "definition": {
                "zh": "规范是社会维护的行为既定标准。\n\n简单来说：社会里大家普遍遵守的“规矩”，告诉你什么能做，什么不能做。比如排队、见面打招呼都是规范。",
                "en": "Norms are established standards of behavior maintained by society.\n\nIn simple terms: These are the 'rules' generally followed in a society, telling you what you can and cannot do. For example, queuing up or greeting people are norms."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "正式规范",
                "en": "Formal Norm"
            },
            "definition": {
                "zh": "正式规范通常被书写下来，并规定了违反行为的严格惩罚。\n\n简单来说：那些写在纸上，有明确惩罚规定的规矩，比如法律、规章制度。",
                "en": "Formal norms are generally written down and specify strict punishments for violations.\n\nIn simple terms: These are rules written down, with clear punishments for breaking them, such as laws and regulations."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "非正式规范",
                "en": "Informal Norm"
            },
            "definition": {
                "zh": "非正式规范通常被理解但没有精确记录。\n\n简单来说：社会中大家默认的、没有明确写下来的规矩，比如穿衣得体、排队不插队等。",
                "en": "Informal norms are generally understood but not precisely recorded.\n\nIn simple terms: These are unspoken, unwritten rules that are generally understood in a society, such as dressing appropriately or not cutting in line."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "道德规范 (Mores)",
                "en": "Mores"
            },
            "definition": {
                "zh": "道德规范是社会认为对社会福祉高度必要并要求服从的规范。\n\n简单来说：社会上那些被认为非常重要，违反了会引起强烈谴责甚至惩罚的规矩，比如不能杀人、不能偷盗。",
                "en": "Mores are norms deemed highly necessary to the welfare of society and demand obedience.\n\nIn simple terms: These are highly important social rules, the violation of which would lead to strong disapproval or even punishment, such as prohibitions against murder or theft."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "风俗 (Folkway)",
                "en": "Folkway"
            },
            "definition": {
                "zh": "风俗是规范日常行为的规范，其违反行为引起的关注相对较少。\n\n简单来说：日常生活中那些比较随意，违反了也不会有严重后果的习惯或礼仪，比如吃饭用筷子还是刀叉，或者在电梯里要不要跟人说话。",
                "en": "A folkway is a norm governing everyday behavior whose violation raises comparatively little concern.\n\nIn simple terms: These are informal customs or courtesies in daily life, the violation of which doesn't lead to serious consequences, such as using chopsticks versus a fork and knife, or whether to talk to people in an elevator."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "制裁",
                "en": "Sanction"
            },
            "definition": {
                "zh": "制裁是指与社会规范相关的行为的惩罚或奖励。\n\n简单来说：为了鼓励人们遵守规范或惩罚违反规范的行为，社会会给予的奖励（如表扬）或惩罚（如罚款、批评）。",
                "en": "A sanction is a penalty or reward for conduct concerning a social norm.\n\nIn simple terms: These are rewards (like praise) or punishments (like fines, criticism) given by society to encourage people to follow norms or to penalize those who violate them."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "价值观",
                "en": "Value"
            },
            "definition": {
                "zh": "价值观是关于文化中什么是好的、可取的和适当的，或者什么是坏的、不可取的和不适当的集体观念。\n\n简单来说：一个社会普遍认为“什么重要”、“什么正确”的信念。比如，诚实、自由、努力工作在很多文化中都是重要的价值观。",
                "en": "A value is a collective conception of what is considered good, desirable, and proper—or bad, undesirable, and improper—in a culture.\n\nIn simple terms: These are the beliefs that a society generally considers 'important' or 'right.' For example, honesty, freedom, and hard work are important values in many cultures."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化战争",
                "en": "Culture War"
            },
            "definition": {
                "zh": "文化战争是指社会围绕有争议的文化要素产生两极分化的现象。\n\n简单来说：当社会中不同群体在一些重要的文化议题（比如价值观、道德观、生活方式等）上发生激烈争执，导致社会分裂和对抗时，就称为文化战争。例如关于堕胎权、同性婚姻的争论。",
                "en": "Culture war refers to the polarization of society over controversial cultural elements.\n\nIn simple terms: When different groups in a society intensely dispute important cultural issues (such as values, morals, lifestyles), leading to social division and confrontation, it's called a culture war. Examples include debates over abortion rights or same-sex marriage."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "主导意识形态",
                "en": "Dominant Ideology"
            },
            "definition": {
                "zh": "主导意识形态是一套有助于维护强大社会、经济和政治利益的文化信仰和实践。\n\n简单来说：一个社会中，那些掌握权力的人（或群体）所推崇和传播的思想、观念，它们通常有利于维护现有秩序和他们的利益。",
                "en": "A dominant ideology is a set of cultural beliefs and practices that help maintain powerful social, economic, and political interests.\n\nIn simple terms: These are the ideas and beliefs promoted and disseminated by those in power (or dominant groups) in a society, which generally serve to maintain the existing order and their interests."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "亚文化",
                "en": "Subculture"
            },
            "definition": {
                "zh": "亚文化是社会中一个共享不同于主流社会模式的独特风俗、民俗和价值观的群体。\n\n简单来说：一个大文化里面，有一群人有自己独特的爱好、语言、习惯，但总体上还是认同主流文化。比如，动漫迷群体、某个地方的方言使用者。",
                "en": "A subculture is a segment of society that shares a distinctive pattern of mores, folkways, and values that differs from the pattern of the larger society.\n\nIn simple terms: Within a larger culture, there's a group of people with unique hobbies, language, and customs, but they generally still identify with the mainstream culture. Examples include anime fans or speakers of a regional dialect."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "行话 (Argot)",
                "en": "Argot"
            },
            "definition": {
                "zh": "行话是特定群体或亚文化成员使用的专业语言。\n\n简单来说：特定圈子里的人才懂的“黑话”或专业术语。比如程序员之间的“bug”、“debug”，或者游戏玩家的“GG”、“MVP”。",
                "en": "Argot is specialized language used by members of a group or subculture.\n\nIn simple terms: It's jargon or specialized terminology understood only by people within a specific group. For example, 'bug' and 'debug' among programmers, or 'GG' and 'MVP' among gamers."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "反文化",
                "en": "Counterculture"
            },
            "definition": {
                "zh": "反文化是故意反对较大文化某些方面的亚文化。\n\n简单来说：一个群体不仅有自己的特色，还明确反对或挑战主流文化的一些价值观和行为。比如上世纪的嬉皮士运动。",
                "en": "A counterculture is a subculture that conspicuously and deliberately opposes certain aspects of the larger culture.\n\nIn simple terms: A group that not only has its own characteristics but also explicitly opposes or challenges some values and behaviors of the mainstream culture. An example is the hippie movement of the last century."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化冲击",
                "en": "Culture Shock"
            },
            "definition": {
                "zh": "文化冲击是指人们在遇到与自己不同的文化习俗时所经历的惊喜和迷失感。\n\n简单来说：当你到了一个完全陌生的国家或环境，发现当地人的生活方式、习惯和你自己完全不同，感到很惊讶、不适应甚至有点困惑和不安，这就是文化冲击。",
                "en": "Culture shock refers to the surprise and disorientation experienced when people encounter cultural practices different from their own.\n\nIn simple terms: When you arrive in a completely unfamiliar country or environment and find that the local way of life and customs are totally different from your own, feeling surprised, uncomfortable, or even confused and uneasy, that's culture shock."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "创新",
                "en": "Innovation"
            },
            "definition": {
                "zh": "创新是指向文化引入新想法或新事物的过程。\n\n简单来说：创造出新的东西或者发现以前不知道的东西，比如发明了轮子，或者发现了电。",
                "en": "Innovation refers to the process of introducing a new idea or object to a culture.\n\nIn simple terms: Creating something new or discovering something previously unknown, such as inventing the wheel or discovering electricity."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "发现",
                "en": "Discovery"
            },
            "definition": {
                "zh": "发现是指揭示或分享某一方面现实存在的过程。\n\n简单来说：把原来就存在但还没被人类知道的东西找出来，比如发现了新大陆，或者发现了DNA的结构。",
                "en": "Discovery involves making known or sharing the existence of an aspect of reality.\n\nIn simple terms: Uncovering something that already exists but was previously unknown to humans, such as discovering a new continent or the structure of DNA."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "发明",
                "en": "Invention"
            },
            "definition": {
                "zh": "发明是指将现有文化物品组合成以前不存在的形式。\n\n简单来说：把现有的东西重新组合，创造出全新的东西，比如把轮子和马车结合起来发明了汽车，或者把文字和印刷术结合起来发明了活字印刷。",
                "en": "Invention results when existing cultural items are combined into a form that did not exist before.\n\nIn simple terms: Combining existing elements to create something entirely new, such as combining wheels and carriages to invent the automobile, or combining writing and printing to invent movable type printing."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "扩散",
                "en": "Diffusion"
            },
            "definition": {
                "zh": "扩散是指文化物品从一个群体传播到另一个群体或社会的过程。\n\n简单来说：一个地方的文化元素（比如食物、时尚、技术）传播到另一个地方，被当地人接受并使用。就像手机从一个国家流行到全世界。",
                "en": "Diffusion refers to the process by which a cultural item spreads from group to group or society to society.\n\nIn simple terms: When cultural elements (like food, fashion, technology) from one place spread to another and are adopted by the local people. For example, mobile phones becoming popular worldwide after originating in one country."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "麦当劳化",
                "en": "McDonaldization"
            },
            "definition": {
                "zh": "麦当劳化是指许多行业（如高等教育、购物、银行和医疗保健）采纳最初与快餐业相关的特征的过程。\n\n简单来说：就是指像麦当劳快餐店那样，追求效率、可预测性、可计算性和控制，并且逐渐把这种模式推广到社会生活的各个领域，比如去医院看病也像点快餐一样流程化。",
                "en": "McDonaldization refers to the adoption of characteristics originally associated with the fast food industry by many other industries, such as higher education, shopping, banking, and health care.\n\nIn simple terms: It refers to the process where various sectors of society adopt the principles of efficiency, predictability, calculability, and control, similar to those found in fast-food restaurants like McDonald's. For example, when visiting a hospital becomes as standardized and process-driven as ordering fast food."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "技术",
                "en": "Technology"
            },
            "definition": {
                "zh": "技术是指关于如何利用环境中的物质资源来满足人类需求和欲望的文化信息。\n\n简单来说：我们如何利用工具、知识和技能来改造自然、解决问题，比如手机、互联网、农业灌溉系统，都是技术的体现。",
                "en": "Technology refers to cultural information about the ways in which the material resources of the environment may be used to satisfy human needs and desires.\n\nIn simple terms: It's how we use tools, knowledge, and skills to transform nature and solve problems. Examples include mobile phones, the internet, and agricultural irrigation systems, all of which are manifestations of technology."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "物质文化",
                "en": "Material Culture"
            },
            "definition": {
                "zh": "物质文化是指我们日常生活中的物理或技术方面。\n\n简单来说：所有能被我们看到、摸到的具体物品，比如衣服、汽车、建筑物、手机等。",
                "en": "Material culture refers to the physical or technological aspects of our daily lives.\n\nIn simple terms: All tangible items that we can see and touch, such as clothes, cars, buildings, and mobile phones."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "非物质文化",
                "en": "Nonmaterial Culture"
            },
            "definition": {
                "zh": "非物质文化是指使用物质对象的方式，以及习俗、信仰、哲学和交流模式。\n\n简单来说：那些看不见、摸不着的文化元素，比如价值观、信仰、语言、风俗习惯、政府形式等。",
                "en": "Nonmaterial culture refers to ways of using material objects, as well as customs, beliefs, philosophies, governments, and patterns of communication.\n\nIn simple terms: These are the intangible cultural elements, such as values, beliefs, language, customs, and forms of government."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "文化滞后",
                "en": "Culture Lag"
            },
            "definition": {
                "zh": "文化滞后是指非物质文化仍在努力适应新物质条件时的失调时期。\n\n简单来说：当一项新技术（物质文化）出现得很快，但社会中人们的观念、法律、道德（非物质文化）却跟不上，导致两者之间出现不协调或冲突。比如网络技术的快速发展，但关于网络隐私和版权的法律却迟迟未能完善。",
                "en": "Culture lag refers to the period of maladjustment when the nonmaterial culture is still struggling to adapt to new material conditions.\n\nIn simple terms: When a new technology (material culture) emerges rapidly, but society's ideas, laws, and morals (nonmaterial culture) fail to keep pace, leading to a disconnect or conflict between the two. For example, the rapid development of internet technology while laws regarding online privacy and copyright lag behind."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "文化入门",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "双语制",
                "en": "Bilingualism"
            },
            "definition": {
                "zh": "双语制是指在特定环境（如工作场所或学校）中使用两种语言，将每种语言视为同等合法。\n\n简单来说：在同一个地方（比如一个学校或一个国家），同时使用两种语言进行交流和教学，并且这两种语言都受到尊重，拥有平等的地位。",
                "en": "Bilingualism refers to the use of two languages in a particular setting, such as the workplace or schoolroom, treating each language as equally legitimate.\n\nIn simple terms: It means using two languages simultaneously in the same place (like a school or a country) for communication and instruction, with both languages being respected and having equal status."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会化",
                "en": "Socialization"
            },
            "definition": {
                "zh": "社会化是人们学习适合作为特定文化成员的态度、价值观和行为的终身过程。\n\n简单来说：社会化就是一个人从出生到死亡，不断学习如何成为社会一员的过程，包括学习语言、行为规范、价值观等，从而形成自己的个性。",
                "en": "Socialization is the lifelong process in which people learn the attitudes, values, and behaviors appropriate for members of a particular culture.\n\nIn simple terms: Socialization is the lifelong process from birth to death where individuals continuously learn how to be a member of society, including learning language, behavioral norms, values, and thus forming their personality."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "自我",
                "en": "Self"
            },
            "definition": {
                "zh": "自我是一个独特的身份，使我们与他人区分开来。\n\n简单来说：自我就是我们对自己的认识和感受，包括我们的个性、能力、价值观等，是我们区别于他人的独特之处。",
                "en": "The self is a distinct identity that sets each of us apart from others.\n\nIn simple terms: The self is our understanding and feelings about who we are, including our personality, abilities, and values, which make us unique from others."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "镜中我",
                "en": "Looking-Glass Self"
            },
            "definition": {
                "zh": "库利的镜中我理论认为，我们的自我意识源于我们如何向他人展示自己，他人如何评价我们，以及我们如何内化或评估这些评价。\n\n简单来说：我们对自己的看法，就像照镜子一样，是基于我们想象中别人如何看待我们、评价我们，然后我们根据这些想象形成对自己的感觉。",
                "en": "Cooley's looking-glass self suggests that our sense of self results from how we present ourselves to others, how others evaluate us, and how we internalize or assess those evaluations.\n\nIn simple terms: Our self-perception is like looking in a mirror, based on how we imagine others see and evaluate us, and then forming feelings about ourselves based on those imagined impressions."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "角色扮演",
                "en": "Role Taking"
            },
            "definition": {
                "zh": "角色扮演是心理上设想他人的视角并从想象中的观点做出回应的过程。\n\n简单来说：就是设身处地地想象自己是另一个人，从他们的角度去思考和感受，从而更好地理解他人。",
                "en": "Role taking is the process of mentally assuming the perspective of another and responding from that imagined viewpoint.\n\nIn simple terms: It's putting yourself in someone else's shoes, imagining their perspective, and thinking and feeling as they would, to better understand them."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "概化他人",
                "en": "Generalized Other"
            },
            "definition": {
                "zh": "概化他人是指社会中他人（作为一个整体）的态度、观点和期望，个体在以特定方式行动之前会考虑到这些。\n\n简单来说：社会作为一个整体对我们行为的普遍期望和规范，我们通过与他人的互动逐渐内化这些期望，从而指导自己的行为。",
                "en": "The term generalized other refers to the attitudes, viewpoints, and expectations of others in society as a whole that an individual takes into account before acting in a particular way.\n\nIn simple terms: It's the general expectations and norms of society as a whole regarding our behavior, which we gradually internalize through interaction with others, guiding our own actions."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "重要他人",
                "en": "Significant Other"
            },
            "definition": {
                "zh": "重要他人是指在个体发展中最重要的个人，例如父母、朋友或老师。\n\n简单来说：对一个人的自我发展和个性形成影响最大的人，通常是家庭成员、亲密朋友或老师等。",
                "en": "A significant other is an individual who is most important in the development of the self, such as a parent, friend, or teacher.\n\nIn simple terms: The individuals who have the most significant influence on a person's self-development and personality formation, typically family members, close friends, or teachers."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "印象管理",
                "en": "Impression Management"
            },
            "definition": {
                "zh": "印象管理是指个体通过改变自我的呈现方式，以创造独特的外表并满足特定受众的过程。\n\n简单来说：为了给别人留下特定的印象，我们有意识地调整自己的言行举止，比如面试时表现得专业，约会时表现得迷人。",
                "en": "Impression management involves an individual's slanting their presentation of the self to create distinctive appearances and to satisfy particular audiences.\n\nIn simple terms: Consciously adjusting our words and behaviors to create a specific impression on others, such as acting professionally during an interview or charming on a date."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "戏剧学方法",
                "en": "Dramaturgical Approach"
            },
            "definition": {
                "zh": "戏剧学方法是基于人们像演员一样行事，通过呈现被认为能取悦他人的形象的观点。\n\n简单来说：把社会互动看作一场戏剧表演，每个人都在扮演自己的角色，努力向观众（其他人）呈现一个理想的形象。",
                "en": "The dramaturgical approach is based upon people behaving as actors by putting forth an image believed to be pleasing to others.\n\nIn simple terms: It views social interaction as a theatrical performance, where everyone plays a role and strives to present an ideal image to their audience (others)."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "面子工作",
                "en": "Facework"
            },
            "definition": {
                "zh": "戈夫曼的面子工作涉及人们为保持适当形象和避免公开尴尬所做的努力。\n\n简单来说：为了维护自己在他人面前的形象和尊严，避免出丑或尴尬而采取的各种言行举止。",
                "en": "Goffman's facework involves people trying to maintain or save an image or face and avoid public embarrassment.\n\nIn simple terms: Various words and behaviors adopted to maintain one's image and dignity in front of others and to avoid embarrassment or losing face."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "认知发展理论",
                "en": "Cognitive Theory of Development"
            },
            "definition": {
                "zh": "认知发展理论是关于儿童思维通过四个发展阶段进步的理论。\n\n简单来说：皮亚杰提出的理论，认为儿童的思维能力是分阶段发展的，从感知和动作开始，逐步发展出抽象思维能力。",
                "en": "The cognitive theory of development is the theory that children's thought progresses through four stages of development.\n\nIn simple terms: Piaget's theory suggests that children's cognitive abilities develop in stages, starting from sensory and motor actions and gradually progressing to abstract thought."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "性别角色",
                "en": "Gender Role"
            },
            "definition": {
                "zh": "性别角色是指关于男性和女性适当行为、态度和活动的期望。\n\n简单来说：社会对男性和女性应该如何表现、思考和行动的普遍期望和规范。",
                "en": "Gender role refers to expectations regarding the proper behavior, attitudes, and activities of males and females.\n\nIn simple terms: Societal expectations and norms about how males and females should behave, think, and act."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "生命历程方法",
                "en": "Life Course Approach"
            },
            "definition": {
                "zh": "生命历程方法是一种研究取向，社会学家和其他社会科学家密切关注影响人们从出生到死亡的社会因素。\n\n简单来说：这是一种研究视角，关注一个人从出生到死亡的整个生命过程中，社会因素如何持续地影响着他们的发展和经历。",
                "en": "The life course approach is a research orientation in which sociologists and other social scientists look closely at the social factors that influence people throughout their lives, from birth to death.\n\nIn simple terms: It's a research perspective that focuses on how social factors continuously influence an individual's development and experiences throughout their entire life, from birth to death."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "通过仪式",
                "en": "Rite of Passage"
            },
            "definition": {
                "zh": "通过仪式是标志从一个社会地位到另一个社会地位的象征性过渡的仪式。\n\n简单来说：在一个人生命中，从一个阶段过渡到另一个阶段时，社会会举行一些特殊的仪式来庆祝或确认这种变化，比如成年礼、婚礼、毕业典礼等。",
                "en": "A rite of passage is a ritual marking the symbolic transition from one social position to another.\n\nIn simple terms: Special ceremonies held by society to celebrate or confirm a person's transition from one life stage to another, such as coming-of-age ceremonies, weddings, or graduation ceremonies."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "预期性社会化",
                "en": "Anticipatory Socialization"
            },
            "definition": {
                "zh": "预期性社会化是指一个人为未来可能承担的角色、职业和社会关系进行排练的社会化过程。\n\n简单来说：在真正进入某个新角色之前，提前学习和练习这个角色所需的行为和态度，比如高中生为上大学做准备，或者准妈妈学习育儿知识。",
                "en": "Anticipatory socialization refers to a person rehearsing for future positions, occupations, and social relationships.\n\nIn simple terms: Learning and practicing the behaviors and attitudes required for a new role before actually entering it, such as high school students preparing for college, or expectant mothers learning about childcare."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "再社会化",
                "en": "Resocialization"
            },
            "definition": {
                "zh": "再社会化是指抛弃旧的行为模式并接受新行为模式，作为一个人生活中过渡的一部分。\n\n简单来说：当一个人进入一个全新的环境，需要彻底放弃旧有的行为习惯和价值观，学习并适应一套全新的行为模式，比如进入军队、监狱或修道院。",
                "en": "Resocialization refers to discarding former behavior patterns and accepting new ones as part of a transition in one's life.\n\nIn simple terms: When a person enters a completely new environment and needs to completely abandon old behaviors and values, learning and adapting to a new set of behavioral patterns, such as entering the military, prison, or a convent."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "全控机构",
                "en": "Total Institution"
            },
            "definition": {
                "zh": "全控机构是指在单一权力下规范一个人生活所有方面的机构，例如监狱、军队、精神病院或修道院。\n\n简单来说：一种完全控制个人生活各个方面，使其与外界隔绝的机构，目的是对个人进行彻底的改造或规训。",
                "en": "A total institution is an institution that regulates all aspects of a person's life under a single authority, such as a prison, the military, a mental hospital, or a convent.\n\nIn simple terms: An institution that completely controls every aspect of an individual's life, isolating them from the outside world, with the aim of thoroughly transforming or disciplining them."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "贬低仪式",
                "en": "Degradation Ceremony"
            },
            "definition": {
                "zh": "贬低仪式是全控机构内社会化过程的一个方面，其中人们受到羞辱性仪式的对待。\n\n简单来说：在全控机构中，为了让个人放弃旧的自我认同，会通过一些公开的、羞辱性的仪式来摧毁其自尊和个性，使其更容易接受新的规则和身份。",
                "en": "A degradation ceremony is an aspect of the socialization process within some total institutions, in which people are subjected to humiliating rituals.\n\nIn simple terms: In total institutions, certain public, humiliating rituals are used to strip individuals of their old self-identity and self-esteem, making them more receptive to new rules and identities."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "中年危机",
                "en": "Midlife Crisis"
            },
            "definition": {
                "zh": "中年危机是一个通常始于40岁左右的自我评估的压力时期。\n\n简单来说：一个人在40岁左右时，对自己的生活、成就和未来产生疑问和焦虑，从而经历一个充满压力的自我反思时期。",
                "en": "A midlife crisis is a stressful period of self-evaluation that commonly begins at about age 40.\n\nIn simple terms: A period of intense self-reflection and anxiety that typically begins around age 40, where individuals question their life, achievements, and future."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "夹心世代",
                "en": "Sandwich Generation"
            },
            "definition": {
                "zh": "夹心世代是指同时努力满足父母和子女相互竞争需求的成年人。\n\n简单来说：指那些既要照顾年迈的父母，又要抚养未成年子女的成年人，他们就像被夹在中间一样，承受着双重压力。",
                "en": "The sandwich generation consists of adults who simultaneously try to meet the competing needs of their parents and their children.\n\nIn simple terms: Adults who are simultaneously caring for their elderly parents and raising their minor children, experiencing dual pressures as if they are 'sandwiched' between two generations."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会化与生命历程",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "自然形成退休社区 (NORC)",
                "en": "Naturally Occurring Retirement Community (NORC)"
            },
            "definition": {
                "zh": "自然形成退休社区是指一个逐渐成为老年人非正式中心的区域。\n\n简单来说：一个社区，最初不是专门为老年人设计的，但随着居民年龄增长，逐渐聚集了大量老年人，并形成了为老年人服务的非正式网络和设施。",
                "en": "A Naturally Occurring Retirement Community (NORC) is an area that has gradually become an informal center for senior citizens.\n\nIn simple terms: A community not originally designed for seniors, but which gradually attracts a large number of older residents as its inhabitants age, forming an informal network and facilities that cater to seniors."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会互动",
                "en": "Social Interaction"
            },
            "definition": {
                "zh": "社会互动是指人们相互回应的方式。\n\n简单来说：就是人与人之间相互交流、相互影响的各种行为和过程，比如对话、眼神交流、合作或冲突。",
                "en": "Social interaction refers to the ways in which people respond to one another.\n\nIn simple terms: It encompasses all the ways people communicate and influence each other, such as conversations, eye contact, cooperation, or conflict."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会结构",
                "en": "Social Structure"
            },
            "definition": {
                "zh": "社会结构是指一个社会组织成可预测关系的方式。\n\n简单来说：社会中人与人之间、群体与群体之间形成的相对稳定和有规律的模式和关系，比如家庭、学校、政府等制度，以及人们在这些制度中的地位和角色。",
                "en": "Social structure refers to the way in which a society is organized into predictable relationships.\n\nIn simple terms: It's the relatively stable and patterned ways in which people and groups are organized within a society, including institutions like family, school, and government, as well as the statuses and roles people occupy within them."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "地位",
                "en": "Status"
            },
            "definition": {
                "zh": "地位是社会学中用来指一个大型群体或社会中所有社会定义的职位的术语。\n\n简单来说：一个人在社会中或群体中所占据的任何社会位置，比如“学生”、“医生”、“父亲”等。",
                "en": "Status is a term used by sociologists to refer to any of the full range of socially defined positions within a large group or society.\n\nIn simple terms: Any social position an individual occupies within a society or group, such as 'student,' 'doctor,' or 'father'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "先赋地位",
                "en": "Ascribed Status"
            },
            "definition": {
                "zh": "先赋地位是社会赋予一个人的社会地位，不考虑其独特的才能或特征，通常在出生时就已确定。\n\n简单来说：一个人出生时就获得，或者非自愿被社会赋予的地位，比如种族、性别、年龄等，不是通过自己的努力获得的。",
                "en": "Ascribed status is a social position assigned to a person by society without regard for the person's unique talents or characteristics, generally at birth.\n\nIn simple terms: A status an individual is born with or involuntarily assigned by society, such as race, gender, or age, not earned through personal effort."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "自致地位",
                "en": "Achieved Status"
            },
            "definition": {
                "zh": "自致地位主要是通过一个人的努力获得的。\n\n简单来说：一个人通过自己的努力、选择和行动获得的社会地位，比如“律师”、“教授”、“罪犯”等。",
                "en": "Achieved status is attained by a person largely through their own efforts.\n\nIn simple terms: A social position an individual earns through their own efforts, choices, and actions, such as 'lawyer,' 'professor,' or 'convict'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "主导地位",
                "en": "Master Status"
            },
            "definition": {
                "zh": "主导地位是指支配其他地位，从而决定一个人在社会中的总体地位的地位。\n\n简单来说：在一个人所有的地位中，最能定义和影响其社会身份和他人对其看法的那个地位，比如“残疾人”、“医生”或“囚犯”。",
                "en": "A master status dominates other statuses and thereby determines a person's general position within society.\n\nIn simple terms: The most defining and influential status among all of an individual's statuses, shaping their social identity and how others perceive them, such as 'person with a disability,' 'doctor,' or 'convict'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会角色",
                "en": "Social Role"
            },
            "definition": {
                "zh": "社会角色是对于占据特定社会位置或身份的人们的一系列期望。\n\n简单来说：社会对处于特定地位的人应该如何行为、思考和感受的一套规范和期望。比如，一个“老师”应该教书育人，一个“学生”应该努力学习。",
                "en": "A social role is a set of expectations for people who occupy a given social position or status.\n\nIn simple terms: A set of norms and expectations that society has for how people in a specific status should behave, think, and feel. For example, a 'teacher' is expected to educate, and a 'student' is expected to study diligently."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "角色冲突",
                "en": "Role Conflict"
            },
            "definition": {
                "zh": "角色冲突发生在同一个人所担任的两个或多个社会职位出现不兼容的期望时。\n\n简单来说：当一个人同时扮演多个角色，而这些角色之间有矛盾的要求，让他难以同时满足。比如，一个警察既是执法者，又是自己孩子的父母，在处理自己孩子犯错时可能面临冲突。",
                "en": "Role conflict occurs when incompatible expectations arise from two or more social positions held by the same person.\n\nIn simple terms: When an individual simultaneously plays multiple roles, and these roles have conflicting demands, making it difficult to satisfy them all. For example, a police officer who is also a parent might face conflict when dealing with their own child's misbehavior."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "角色紧张",
                "en": "Role Strain"
            },
            "definition": {
                "zh": "角色紧张是指同一社会地位施加相互冲突的需求和期望时所产生的困难。\n\n简单来说：当一个人扮演一个角色时，这个角色本身就有内在的矛盾或多重压力，让他感到难以应对。比如，一个经理既要严格管理员工，又要关心员工福利，可能感到紧张。",
                "en": "Role strain refers to the difficulty that arises when the same social position imposes conflicting demands and expectations.\n\nIn simple terms: When a single role an individual plays has inherent contradictions or multiple pressures, making it difficult to cope. For example, a manager who needs to be strict with employees but also care for their well-being might experience strain."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "角色退出",
                "en": "Role Exit"
            },
            "definition": {
                "zh": "角色退出是指脱离一个对其自我认同至关重要的角色，以便建立新角色和身份的过程。\n\n简单来说：一个人放弃一个对他来说非常重要的身份和角色，转而接受一个新的身份和生活方式。比如，从学生身份转变为职场人士，或者离婚后放弃“配偶”身份。",
                "en": "Role exit is the process of disengaging from a role that is central to one's self-identity in order to establish a new role and identity.\n\nIn simple terms: The process of an individual giving up a significant identity and role to adopt a new one and a new way of life. For example, transitioning from a student to a professional, or relinquishing the 'spouse' identity after divorce."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "群体",
                "en": "Group"
            },
            "definition": {
                "zh": "群体是指任何数量的具有相似规范、价值观和期望并定期相互交流的人。\n\n简单来说：一群人有共同的特点、价值观，并且经常在一起互动，比如一个篮球队、一个大学联谊会。",
                "en": "A group consists of any number of people with similar norms, values, and expectations who interact with one another on a regular basis.\n\nIn simple terms: A collection of people with shared characteristics, values, and regular interactions, such as a basketball team or a college fraternity."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "初级群体",
                "en": "Primary Group"
            },
            "definition": {
                "zh": "初级群体是特征为亲密、面对面互动和合作的小群体。\n\n简单来说：规模小、成员之间关系亲密、互动频繁、情感联系深厚的群体，比如家庭、亲密的朋友圈。",
                "en": "A primary group is a small group characterized by intimate, face-to-face association and cooperation.\n\nIn simple terms: A small group with close, frequent, and emotionally deep interactions among its members, such as a family or a close circle of friends."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "次级群体",
                "en": "Secondary Group"
            },
            "definition": {
                "zh": "次级群体是正式的、非个人化的群体，其中社会亲密感或相互理解很少。\n\n简单来说：规模较大、成员之间关系不那么亲密、互动更正式、以完成特定目标为主的群体，比如一个公司、一个大学班级。",
                "en": "A secondary group is a formal, impersonal group in which there is little social intimacy or mutual understanding.\n\nIn simple terms: A larger group where relationships among members are less intimate, interactions are more formal, and the group primarily focuses on achieving specific goals, such as a company or a university class."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "内群体",
                "en": "In-group"
            },
            "definition": {
                "zh": "内群体是人们觉得他们属于的任何群体或类别。\n\n简单来说：一个人觉得自己是其中一员，并对其有归属感、认同感的群体。通常会觉得“我们”比“他们”好。",
                "en": "An in-group is any group or category to which people feel they belong.\n\nIn simple terms: A group that an individual feels they belong to and identifies with, often perceiving 'us' as superior to 'them'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "外群体",
                "en": "Out-group"
            },
            "definition": {
                "zh": "外群体是人们觉得他们不属于的任何群体或类别。\n\n简单来说：一个人不属于，也不认同的群体，通常会觉得“他们”和“我们”不同。",
                "en": "An out-group is any group or category to which people feel they do not belong.\n\nIn simple terms: A group that an individual does not belong to or identify with, often perceiving 'them' as different from 'us'."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "参照群体",
                "en": "Reference Group"
            },
            "definition": {
                "zh": "参照群体是个人用来评估自己和自己行为标准的任何群体。\n\n简单来说：一个我们用来比较自己、衡量自己行为是否合适的群体，即使我们不一定是这个群体的成员。比如，一个学生会模仿他们崇拜的明星群体。",
                "en": "A reference group is any group that individuals use as a standard for evaluating themselves and their own behavior.\n\nIn simple terms: A group we use to compare ourselves and evaluate our behavior, even if we are not members of that group. For example, a student might emulate a group of celebrities they admire."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "联盟",
                "en": "Coalition"
            },
            "definition": {
                "zh": "联盟是为实现共同目标而形成的临时或永久性联盟。\n\n简单来说：为了共同的目标，不同群体或个人暂时或长期地联合起来。",
                "en": "A coalition is a temporary or permanent alliance geared toward a common goal.\n\nIn simple terms: Different groups or individuals temporarily or permanently uniting to achieve a common objective."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会网络",
                "en": "Social Network"
            },
            "definition": {
                "zh": "社会网络是一系列社会关系，将一个人直接与他人联系起来，并通过他们间接与更多人联系。\n\n简单来说：由人际关系构成的复杂网络，一个人通过朋友认识朋友的朋友，形成一个庞大的关系网。",
                "en": "A social network is a series of social relationships that links a person directly to others and through them indirectly to still more people.\n\nIn simple terms: A complex web of human relationships where an individual is connected to others, and through them, to even more people, forming a vast network of connections."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会机构",
                "en": "Social Institution"
            },
            "definition": {
                "zh": "社会机构是围绕基本社会需求（如人员更替（家庭）和维护秩序（政府））而形成的信仰和行为的组织模式。\n\n简单来说：为了满足社会的基本需求而建立的、有组织、有规律的信仰和行为模式，比如家庭、教育、政府、经济、宗教等。",
                "en": "A social institution is an organized pattern of beliefs and behavior centered on meeting basic social needs such as replacing personnel (the family) and preserving order (the government).\n\nIn simple terms: Organized and regular patterns of beliefs and behaviors established to meet fundamental societal needs, such as family, education, government, economy, and religion."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "正式组织",
                "en": "Formal Organization"
            },
            "definition": {
                "zh": "正式组织是为特定目的而设计并为实现最大效率而构建的群体。\n\n简单来说：为了实现某个特定目标而有意识地建立起来的、有明确规则和结构的群体，比如公司、大学、政府机构。",
                "en": "A formal organization is a group designed for a special purpose and structured for maximum efficiency.\n\nIn simple terms: A group intentionally established with clear rules and structures to achieve a specific purpose, such as a company, university, or government agency."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "官僚制",
                "en": "Bureaucracy"
            },
            "definition": {
                "zh": "官僚制是正式组织的一个组成部分，它利用规则和层级排名来提高效率。\n\n简单来说：一种组织管理方式，特点是分工明确、层级森严、规则书面化、非个人化、按技术资格雇佣，目的是为了高效运作。",
                "en": "A bureaucracy is a component of formal organization that uses rules and hierarchical ranking to achieve efficiency.\n\nIn simple terms: An organizational management system characterized by clear division of labor, strict hierarchy, written rules, impersonality, and employment based on technical qualifications, all aimed at efficient operation."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "异化",
                "en": "Alienation"
            },
            "definition": {
                "zh": "异化是一种与周围社会疏远或分离的状态。\n\n简单来说：在官僚制下，工人因为过度专业化，觉得自己的工作没有意义，与工作产品、同事甚至自身都产生了疏离感。",
                "en": "Alienation is a condition of estrangement or dissociation from the surrounding society.\n\nIn simple terms: In a bureaucracy, workers, due to over-specialization, feel their work is meaningless and experience a sense of detachment from the product of their labor, their colleagues, and even themselves."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "训练有素的无能",
                "en": "Trained Incapacity"
            },
            "definition": {
                "zh": "训练有素的无能是指官僚机构中的工人变得如此专业化，以至于他们产生盲点并未能注意到明显问题的倾向。\n\n简单来说：一个人因为在某个领域过度专业化，反而对其他领域或整体情况视而不见，导致无法解决简单或明显的问题。",
                "en": "Trained incapacity is the tendency of workers in a bureaucracy to become so specialized that they develop blind spots and fail to notice obvious problems.\n\nIn simple terms: When someone becomes so specialized in one area that they develop blind spots and fail to notice obvious problems or broader issues outside their narrow expertise."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "目标位移",
                "en": "Goal Displacement"
            },
            "definition": {
                "zh": "目标位移是指过分遵守官僚机构的官方规定，以至于变得功能失调。\n\n简单来说：组织成员过于死板地遵守规则，以至于忘记了组织最初的目标，甚至阻碍了目标的实现。",
                "en": "Goal displacement refers to overzealous conformity to official regulations of a bureaucracy to the point of becoming dysfunctional.\n\nIn simple terms: When members of an organization become so rigid in following rules that they lose sight of the organization's original goals, sometimes even hindering their achievement."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "彼得原理",
                "en": "Peter Principle"
            },
            "definition": {
                "zh": "彼得原理是一种组织生活原则，根据该原则，层级结构中的每个员工都倾向于晋升到他们无法胜任的级别。\n\n简单来说：在组织中，员工会一直被提拔，直到他们升到一个自己能力无法胜任的职位，然后就停留在那个位置上。",
                "en": "The Peter principle is a principle of organizational life according to which every employee within a hierarchy tends to rise to their level of incompetence.\n\nIn simple terms: In an organization, employees are promoted until they reach a position where they are no longer competent, and then they remain in that position."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "官僚化",
                "en": "Bureaucratization"
            },
            "definition": {
                "zh": "官僚化是指一个群体、组织或社会运动变得越来越官僚化的过程。\n\n简单来说：一个组织或群体变得越来越像官僚机构，有更多的规则、层级和正式程序。",
                "en": "Bureaucratization is the process by which a group, organization, or social movement becomes increasingly bureaucratic.\n\nIn simple terms: The process where an organization or group increasingly adopts bureaucratic characteristics, such as more rules, hierarchy, and formal procedures."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "寡头铁律",
                "en": "Iron Law of Oligarchy"
            },
            "definition": {
                "zh": "寡头铁律是一种组织生活原则，根据该原则，即使是民主组织最终也会发展成为由少数人统治的官僚机构。\n\n简单来说：即使是最初很民主的组织，最终也会不可避免地被少数精英领导者所控制，形成一个由少数人统治的寡头政治。",
                "en": "The iron law of oligarchy is a principle of organizational life under which even a democratic organization will eventually develop into a bureaucracy ruled by a few individuals.\n\nIn simple terms: Even organizations that start democratically will inevitably become controlled by a small group of elite leaders, forming an oligarchy ruled by a few."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "机械团结",
                "en": "Mechanical Solidarity"
            },
            "definition": {
                "zh": "机械团结存在于劳动分工最小的社会中。它强调群体团结的集体意识。\n\n简单来说：在早期或简单社会中，人们因为从事相似的工作、拥有相似的信仰和价值观而紧密联系在一起，就像机器的各个部分一样，功能相同，容易替代。",
                "en": "Mechanical solidarity exists in societies with a minimal division of labor. A collective consciousness develops that emphasizes group solidarity.\n\nIn simple terms: In early or simple societies, people are closely connected because they do similar work and share similar beliefs and values, much like parts of a machine that perform the same function and are easily replaceable."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "有机团结",
                "en": "Organic Solidarity"
            },
            "definition": {
                "zh": "有机团结存在于劳动分工复杂的社会中。它强调群体和机构之间的相互依赖性，就像身体的器官相互依赖一样。\n\n简单来说：在现代或复杂社会中，人们因为从事不同的专业工作而相互依赖，就像身体的不同器官一样，虽然功能不同，但缺一不可，共同维持社会运转。",
                "en": "Organic solidarity exists in societies with a complex division of labor. It emphasizes mutual interdependence among groups and institutions—in much the same way as organs of the body are interdependent.\n\nIn simple terms: In modern or complex societies, people are interdependent due to specialized work, much like different organs of a body; though their functions differ, each is essential for the society to function as a whole."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "共同体 (Gemeinschaft)",
                "en": "Gemeinschaft"
            },
            "definition": {
                "zh": "共同体是一种紧密联系的社区，通常存在于农村地区，成员之间通过强烈的个人纽带团结在一起。\n\n简单来说：一种传统、亲密、基于血缘或地域的小型社区，人们相互熟悉，关系紧密，价值观高度一致，通常见于农村生活。",
                "en": "A Gemeinschaft community is a close-knit community, often found in rural areas, in which strong personal bonds unite members.\n\nIn simple terms: A traditional, intimate, small community based on kinship or locality, where people know each other well, have close relationships, and share strong common values, typically found in rural life."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会 (Gesellschaft)",
                "en": "Gesellschaft"
            },
            "definition": {
                "zh": "社会是一种理想类型，是现代城市生活的特征。在这里，大多数人都是陌生人，彼此之间很少有共同点。\n\n简单来说：一种现代、大型、非个人化的社会，人们之间关系疏远，主要基于理性、目标导向的交往，通常见于城市生活。",
                "en": "A Gesellschaft is an ideal type characteristic of modern urban life. Here, most people are strangers and feel little in common with one another.\n\nIn simple terms: A modern, large, impersonal society where relationships are often distant and primarily based on rational, goal-oriented interactions, typically found in urban life."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会文化演进",
                "en": "Sociocultural Evolution"
            },
            "definition": {
                "zh": "社会文化演进是指社会中由于连续性、创新和选择的相互作用而产生的长期社会趋势。\n\n简单来说：社会随着时间推移，在技术、文化和组织结构上发生的变化和发展过程，通常由技术水平的进步驱动。",
                "en": "Sociocultural evolution refers to long-term social trends in societies resulting from the interplay of continuity, innovation, and selection.\n\nIn simple terms: The process of change and development in societies over time, in terms of technology, culture, and organizational structure, often driven by advancements in technology."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "前工业社会",
                "en": "Preindustrial Society"
            },
            "definition": {
                "zh": "前工业社会是技术水平较低的社会，包括狩猎采集社会、园艺社会和农业社会。\n\n简单来说：在工业革命之前，主要依靠自然资源（如狩猎采集）、简单种植（园艺）或基本农业（农业）维持生存的社会。",
                "en": "A preindustrial society is a society with a low level of technology, including hunting-and-gathering, horticultural, and agrarian societies.\n\nIn simple terms: Societies before the Industrial Revolution, primarily relying on natural resources (like hunting and gathering), simple cultivation (horticultural), or basic agriculture (agrarian) for survival."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "工业社会",
                "en": "Industrial Society"
            },
            "definition": {
                "zh": "工业社会是依靠机械化生产商品和服务的社会。\n\n简单来说：以机器生产和工厂化大生产为主的社会，通常伴随着城市化和技术进步。",
                "en": "An industrial society is a society that depends on mechanization to produce its goods and services.\n\nIn simple terms: A society primarily based on machine production and large-scale factory manufacturing, usually accompanied by urbanization and technological advancement."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "后工业社会",
                "en": "Postindustrial Society"
            },
            "definition": {
                "zh": "后工业社会是指其经济系统主要从事信息处理和控制的社会。\n\n简单来说：经济重心从制造业转向服务业和信息产业的社会，信息和知识成为最重要的资源。",
                "en": "A postindustrial society is a society whose economic system is engaged primarily in the processing and control of information.\n\nIn simple terms: A society where the economic focus shifts from manufacturing to service and information industries, with information and knowledge becoming the most important resources."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "社会互动、群体与社会结构",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "后现代社会",
                "en": "Postmodern Society"
            },
            "definition": {
                "zh": "后现代社会是一个技术先进、沉迷于消费品和媒体图像的社会。\n\n简单来说：一个高度依赖技术、信息和全球化，同时人们更加关注消费、媒体形象和个人选择的社会。",
                "en": "A postmodern society is a technologically sophisticated society that is preoccupied with consumer goods and media images.\n\nIn simple terms: A society highly reliant on technology, information, and globalization, where people are also more focused on consumption, media images, and individual choices."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "大众媒体",
                "en": "Mass Media"
            },
            "definition": {
                "zh": "大众媒体是指将信息传播给广泛受众的印刷和电子传播方式。\n\n简单来说：指那些能够把信息传递给大量人群的工具和渠道，比如报纸、电视、广播、传统网站等。",
                "en": "Mass media embrace print and electronic means of communication that carry messages to widespread audiences.\n\nIn simple terms: Tools and channels that can transmit information to a large number of people, such as newspapers, television, radio, and traditional websites."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社交媒体",
                "en": "Social Media"
            },
            "definition": {
                "zh": "社交媒体是指使人们能够创建和分享内容或参与社交网络的网站和在线应用程序。\n\n简单来说：指那些允许用户创建、分享内容并进行社交互动的在线平台，比如微信、微博、Facebook、Twitter等。",
                "en": "Social media refer to the websites and online applications that enable people to create and share content or to participate in social networking.\n\nIn simple terms: Online platforms that allow users to create and share content and engage in social interaction, such as WeChat, Weibo, Facebook, and Twitter."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "麻醉功能失调",
                "en": "Narcotizing Dysfunction"
            },
            "definition": {
                "zh": "麻醉功能失调是指媒体提供如此大量的信息，以至于受众变得麻木，并且无论问题多么紧迫，都未能对信息采取行动的现象。\n\n简单来说：媒体信息太多，把人淹没了，导致人们对重要问题感到麻木，虽然知道很多信息，却不采取实际行动。",
                "en": "Narcotizing dysfunction refers to the phenomenon in which the media provide such massive amounts of coverage that the audience becomes numb and fails to act on the information, regardless of how compelling the issue.\n\nIn simple terms: When media overload makes people numb to important issues, causing them to know a lot but take no action."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "守门",
                "en": "Gatekeeping"
            },
            "definition": {
                "zh": "守门是指媒体行业中少数人控制最终到达受众的材料的过程。\n\n简单来说：媒体公司或政府中的少数人决定哪些信息可以被公众看到，哪些不能。他们就像“守门员”一样，筛选信息。",
                "en": "Gatekeeping is the process by which a relatively small number of people in the media industry control what material eventually reaches the audience.\n\nIn simple terms: A small number of people in media companies or governments decide what information reaches the public and what doesn't. They act as 'gatekeepers,' filtering information."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "数字鸿沟",
                "en": "Digital Divide"
            },
            "definition": {
                "zh": "数字鸿沟是指低收入群体、种族和少数民族、农村居民以及发展中国家公民相对缺乏最新技术的使用机会。\n\n简单来说：不同群体之间在获取和使用信息技术（如互联网、智能手机）方面存在的巨大差距，导致信息和机会的不平等。",
                "en": "The digital divide is the relative lack of access to the latest technologies among low-income groups, racial and ethnic minorities, rural residents, and the citizens of developing countries.\n\nIn simple terms: The significant gap between different groups in accessing and using information technology (such as the internet and smartphones), leading to inequalities in information and opportunities."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会资本",
                "en": "Social Capital"
            },
            "definition": {
                "zh": "社会资本是建立在互惠信任基础上的社会网络的集体利益。\n\n简单来说：通过人际关系网络（比如朋友、同事、社区联系）获得的资源和好处，这些关系基于信任和互助，能帮助个人或群体实现目标。",
                "en": "Social capital is the collective benefit of social networks, which are built on reciprocal trust.\n\nIn simple terms: Resources and benefits gained through social networks (e.g., friends, colleagues, community ties), which are based on trust and mutual assistance, helping individuals or groups achieve their goals."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "意见领袖",
                "en": "Opinion Leader"
            },
            "definition": {
                "zh": "意见领袖是指通过日常个人接触和交流影响他人意见和决策的人。\n\n简单来说：在某个领域或群体中，那些因为专业知识、经验或影响力，能够影响他人观点和决策的人。",
                "en": "An opinion leader is someone who, through day-to-day personal contacts and communication, influences the opinions and decisions of others.\n\nIn simple terms: Individuals who, due to their expertise, experience, or influence, can shape the opinions and decisions of others within a specific field or group."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "网红/影响者",
                "en": "Influencer"
            },
            "definition": {
                "zh": "网红/影响者是指在特定行业（如时尚、电子产品或玩具）建立信誉的社交媒体用户。\n\n简单来说：在社交媒体上拥有大量粉丝，并通过发布内容影响他人购买决策或生活方式的人。",
                "en": "An influencer is a social media user who has established credibility in a specific industry, such as fashion or electronics or toys.\n\nIn simple terms: A social media user with a large following who influences others' purchasing decisions or lifestyles by creating content."
            }
        }
    },
    {
        "course": "Sociology_Intro",
        "unit": "大众媒体与社交媒体",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "刻板印象",
                "en": "Stereotype"
            },
            "definition": {
                "zh": "刻板印象是对群体所有成员不可靠的概括，不承认群体内的个体差异。\n\n简单来说：对某个群体（比如某个民族、某个职业的人）形成的一种过于简化、固定的看法，认为这个群体所有人都一样，不考虑个体差异。",
                "en": "A stereotype is an unreliable generalization about all members of a group that does not recognize individual differences within the group.\n\nIn simple terms: An oversimplified, fixed idea about a particular group (e.g., an ethnic group, a profession), assuming all members are the same without acknowledging individual differences."
            }
        }
    },
    {
        "course": "Sociology_exam",
        "unit": "社会学第二周学习目标回顾",
        "card_data": {
            "type": "flashcard",
            "concept": {
                "zh": "社会化",
                "en": "Socialization"
            },
            "definition": {
                "zh": "人们学习适合其作为特定文化成员的态度、价值观和行为的终身过程。",
                "en": "The lifelong process whereby people learn the attitudes, values, and behaviors appropriate to individuals as members of a particular culture."
            }
        }
    }
]